var popupStack = [];

function checkMatch() {
    var userInput = document.getElementById('inputData').value;

    var database = [
        { id: 1, disease: 'ไข้หวัด', symptoms: ['ไข้สูง', 'มีไข้สูง','ไข้' ,'ไอ', 'เจ็บคอ', 'น้ำมูกไหล', 'คัดจมูก'], treatment: 'ยาแก้ปวดลดไข้ ยาแก้ไอ ยาลดน้ำมูก และพักผ่อนให้เพียงพอ ควรปรึกษาแพทย์' },
        { id: 2, disease: 'ไมเกรน', symptoms: ['ปวดหัว','ปวดหัวรุนแรง', 'เคลื่อนไหวลำบาก', 'คลื่นไส้', 'อาเจียน', 'แพ้แสง'], treatment: 'ยาแก้ปวด ยาขยายหลอดเลือด และยาป้องกันไมเกรน ควรปรึกษาแพทย์' },
        { id: 3, disease: 'เบาหวาน', symptoms: ['กระหายน้ำมาก','หิวน้ำมาก', 'ปัสสาวะบ่อย', 'น้ำหนักลด', 'ตาพร่ามัว'], treatment: 'ยาลดน้ำตาลในเลือด การควบคุมอาหาร และการออกกำลังกาย ควรปรึกษาแพทย์' },
        { id: 4, disease: 'หอบหืด', symptoms: ['หายใจง่าย', 'ไอเรื้อรัง'], treatment: 'ยาขยายหลอดลม ยาควบคุมอาการหอบหืด และหลีกเลี่ยงปัจจัยกระตุ้น ควรปรึกษาแพทย์' },
        { id: 5, disease: 'ความดันโลหิตสูง', symptoms: ['ปวดหัวรุนแรง','ปวดหัว', 'เวียนศีรษะ','มึน', 'หน้ามืด', 'วิงเวียน', 'เหนื่อยง่าย'], treatment: 'ยาลดความดันโลหิต การควบคุมอาหาร และการออกกำลังกาย ควรปรึกษาแพทย์' },
        { id: 6, disease: 'ปอดอักเสบ', symptoms: ['ไอแห้ง', 'ไอมีเสมหะ', 'หายใจลำบาก', 'เจ็บหน้าอก'], treatment: 'ยาปฏิชีวนะ ออกซิเจน และพักผ่อนให้เพียงพอ ควรปรึกษาแพทย์' },
        { id: 7, disease: 'โรคข้ออักเสบ', symptoms: ['ปวดข้อ', 'บวมแดงร้อน', 'บวม','เคลื่อนไหวลำบาก'], treatment: 'ยาแก้ปวด ยาต้านการอักเสบ และกายภาพบำบัด ควรปรึกษาแพทย์' },
        { id: 8, disease: 'โรคกระเพาะอักเสบ', symptoms: ['อ้วก','ปวดท้อง', 'กินข้าวไม่ลง'], treatment: 'ยาปฏิชีวนะ ยาลดกรด และงดอาหารรสจัด ควรปรึกษาแพทย์' },
        { id: 9, disease: 'ลูปัส', symptoms: ['ปวดข้อ', 'อ่อนเพลีย', 'บวม', 'เหนื่อยง่าย', 'มีผื่นตามร่างกาย'], treatment: 'ยาต้านการอักเสบ ยาลดภูมิคุ้มกัน และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 10, disease: 'ไทรอยด์สูง', symptoms: ['น้ำหนักลด', 'มือสั่น', 'เหงื่อออกง่าย', 'หงุดหงิดง่าย'], treatment: 'ยาไทรอยด์ ยาแก้ปวด และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 11, disease: 'ไทรอยด์ต่ำ', symptoms: ['น้ำหนักขึ้น', 'ประจำเดือนมาผิดปกติ', 'ผิวแห้ง', 'เส้นผมร่วง'], treatment: 'ยากระตุ้นไทรอยด์ ยาแก้ปวด และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 12, disease: 'โรคปอดอุดกันเรื้อรัง', symptoms: ['ไอเรื้อรัง', 'หายใจเหนื่อยหอบ'], treatment: 'ยาขยายหลอดลม ยาลดการอักเสบ และออกซิเจน ควรปรึกษาแพทย์' },
        { id: 13, disease: 'โรคลมบ้าหมู', symptoms: ['ชัก'], treatment: 'ยากันชัก ควรปรึกษาแพทย์' },
        { id: 14, disease: 'โรคพาร์กินสัน', symptoms: ['สั่น', 'กล้ามเนื้อแข็งเกร็ง', 'เคลื่อนไหวช้า'], treatment: 'ยารักษาโรคพาร์กินสัน กายภาพบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 15, disease: 'โรคกระดูกกรรไกรไม่ปกติ', symptoms: ['ปวดกราม', 'ปวดฟัน'], treatment: 'ยาแก้ปวด ยาคลายกล้ามเนื้อ และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 16, disease: 'โรคอัลซไฮเมอร์', symptoms: ['สูญเสียความจำ', 'มีปัญหาด้านความคิดและพฤติกรรม'], treatment: 'ยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 17, disease: 'โรคโครห์น', symptoms: ['ปวดท้อง', 'ท้องเสีย', 'อุจจาระร่วง'], treatment: 'ยาต้านการอักเสบ ยาต้านจุลชีพ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 18, disease: 'โรคถุงผนังลำไส้อักเสบ', symptoms: ['ปวดท้อง', 'ท้องเสีย', 'อุจจาระร่วง', 'มีเลือดหรือหนองในอุจจาระ'], treatment: 'ยาต้านการอักเสบ ยาต้านจุลชีพ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 19, disease: 'โรคไตเรื้อรัง', symptoms: ['บวม', 'เหนื่อยง่าย', 'ปัสสาวะบ่อย'], treatment: 'ยาควบคุมความดันโลหิต ยาขับปัสสาวะ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 20, disease: 'โรคเยื่อบุมดลูกต่างที่', symptoms: ['ปวดท้องประจำเดือน', 'ปวดท้องน้อย', 'ท้องอืด', 'ท้องผูก', 'ท้องเสีย'], treatment: 'ยาคุมกำเนิด ยาปฏิชีวนะ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 21, disease: 'โรคไตอักเสบ', symptoms: ['ปวดท้อง', 'ปัสสาวะบ่อย', 'ปัสสาวะเป็นเลือด'], treatment: 'ยาปฏิชีวนะ ยาลดความดันโลหิต และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 22, disease: 'โรคตับแข็ง', symptoms: ['อ่อนเพลีย', 'บวม', 'น้ำหนักลด', 'ท้องอืด', 'ท้องผูก'], treatment: 'ยาปฏิชีวนะ ยาลดความดันโลหิต และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 23, disease: 'โรคโลหิตจาง', symptoms: ['อ่อนเพลีย', 'เวียนศีรษะ', 'หน้ามืด', 'ซีด'], treatment: 'ยาบำรุงเลือด ควรปรึกษาแพทย์' },
        { id: 24, disease: 'มะเร็งเต้านม', symptoms: ['ก้อนที่เต้านม', 'เจ็บเต้านม'], treatment: 'การผ่าตัด รังสีรักษา เคมีบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 25, disease: 'โรคสกิโซฟรีเนีย', symptoms: ['ได้ยินเสียงหลอน', 'ประสาทหลอน', 'พูดจาวกวน'], treatment: 'ยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 26, disease: 'โรคไบโพลาร์', symptoms: ['อารมณ์แปรปรวน', 'ซึมเศร้า', 'อารมณ์ดีผิดปกติ'] , treatment: 'ยารักษาโรคอารมณ์สองขั้ว จิตบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
         ];
        

    var matches = [];

    database.forEach(entry => {
        entry.symptoms.forEach(symptom => {
            if (userInput.includes(symptom)) {
                matches.push(entry);
            }
        });
    });

    closePopup();
    closeTreatmentPopup();

    var popup = document.getElementById('popup');
    var resultElement = document.getElementById('result');

    if (matches.length > 0) {
        var diseaseLinks = matches.map(entry => {
            return '<a href="#" onclick="showTreatmentPopup(' + entry.id + ')">' + entry.disease + '</a>';
        }).join(' หรือ ');

        resultElement.innerHTML = 'คุณอาจจะเป็น: ' + diseaseLinks + '<br>กดตรงโรคเพื่อดูวิธีการรักษา';
    } else {
        resultElement.innerText = 'ขออภัยครับ แต่อาการที่ท่านแจ้งเรานั้นไม่สามารถวินิจฉัยหรือตรวจสอบได้ครับ';
    }

    popup.style.display = 'block';
    popupStack.push(popup);

    return false;
}

function showTreatmentPopup(diseaseId) {
    closePopup();
    closeTreatmentPopup();

    var disease = getDiseaseById(diseaseId);

    var treatmentPopup = document.getElementById('treatmentPopup');
    var treatmentResult = document.getElementById('treatmentResult');

    if (disease) {
        treatmentResult.innerHTML = 'วิธีรักษา: ' + disease.treatment;
    } else {
        treatmentResult.innerText = 'ขออภัยครับ ไม่พบข้อมูลการรักษา';
    }

    treatmentPopup.style.display = 'block';
    popupStack.push(treatmentPopup);
}

function closeTreatmentPopup() {
    var treatmentPopup = popupStack.pop();
    if (treatmentPopup) {
        treatmentPopup.style.display = 'none';
    }
}

function getDiseaseById(diseaseId) {
    var database = [
        { id: 1, disease: 'ไข้หวัด', symptoms: ['ไข้สูง', 'มีไข้สูง','ไข้' ,'ไอ', 'เจ็บคอ', 'น้ำมูกไหล', 'คัดจมูก'], treatment: 'ยาแก้ปวดลดไข้ ยาแก้ไอ ยาลดน้ำมูก และพักผ่อนให้เพียงพอ ควรปรึกษาแพทย์' },
        { id: 2, disease: 'ไมเกรน', symptoms: ['ปวดหัวรุนแรง', 'เคลื่อนไหวลำบาก', 'คลื่นไส้', 'อาเจียน', 'แพ้แสง'], treatment: 'ยาแก้ปวด ยาขยายหลอดเลือด และยาป้องกันไมเกรน ควรปรึกษาแพทย์' },
        { id: 3, disease: 'เบาหวาน', symptoms: ['กระหายน้ำมาก','หิวน้ำมาก', 'ปัสสาวะบ่อย', 'น้ำหนักลด', 'ตาพร่ามัว'], treatment: 'ยาลดน้ำตาลในเลือด การควบคุมอาหาร และการออกกำลังกาย ควรปรึกษาแพทย์' },
        { id: 4, disease: 'หอบหืด', symptoms: ['หายใจง่าย', 'ไอเรื้อรัง'], treatment: 'ยาขยายหลอดลม ยาควบคุมอาการหอบหืด และหลีกเลี่ยงปัจจัยกระตุ้น ควรปรึกษาแพทย์' },
        { id: 5, disease: 'ความดันโลหิตสูง', symptoms: ['ปวดหัว', 'เวียนศีรษะ','มึน', 'หน้ามืด', 'วิงเวียน', 'เหนื่อยง่าย'], treatment: 'ยาลดความดันโลหิต การควบคุมอาหาร และการออกกำลังกาย ควรปรึกษาแพทย์' },
        { id: 6, disease: 'ปอดอักเสบ', symptoms: ['ไอแห้ง', 'ไอมีเสมหะ', 'หายใจลำบาก', 'เจ็บหน้าอก'], treatment: 'ยาปฏิชีวนะ ออกซิเจน และพักผ่อนให้เพียงพอ ควรปรึกษาแพทย์' },
        { id: 7, disease: 'โรคข้ออักเสบราชาไหล', symptoms: ['ปวดข้อ', 'บวมแดงร้อน', 'บวม','เคลื่อนไหวลำบาก'], treatment: 'ยาแก้ปวด ยาต้านการอักเสบ และกายภาพบำบัด ควรปรึกษาแพทย์' },
        { id: 8, disease: 'โรคกระเพาะอักเสบ', symptoms: ['อ้วก','ปวดท้อง', 'กินข้าวไม่ลง'], treatment: 'ยาปฏิชีวนะ ยาลดกรด และงดอาหารรสจัด ควรปรึกษาแพทย์' },
        { id: 9, disease: 'ลูปัส', symptoms: ['ปวดข้อ', 'อ่อนเพลีย', 'บวม', 'เหนื่อยง่าย', 'มีผื่นตามร่างกาย'], treatment: 'ยาต้านการอักเสบ ยาลดภูมิคุ้มกัน และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 10, disease: 'ไทรอยด์เร่ง', symptoms: ['น้ำหนักลด', 'มือสั่น', 'เหงื่อออกง่าย', 'หงุดหงิดง่าย'], treatment: 'ยาไทรอยด์ ยาแก้ปวด และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 11, disease: 'ไทรอยด์ช้า', symptoms: ['น้ำหนักขึ้น', 'ประจำเดือนมาผิดปกติ', 'ผิวแห้ง', 'เส้นผมร่วง'], treatment: 'ยากระตุ้นไทรอยด์ ยาแก้ปวด และยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 12, disease: 'โรคปอดเรื้อรัง', symptoms: ['ไอเรื้อรัง', 'หายใจเหนื่อยหอบ'], treatment: 'ยาขยายหลอดลม ยาลดการอักเสบ และออกซิเจน ควรปรึกษาแพทย์' },
        { id: 13, disease: 'โรคลมบ้าหมู', symptoms: ['ชัก'], treatment: 'ยากันชัก ควรปรึกษาแพทย์' },
        { id: 14, disease: 'โรคพาร์กินสัน', symptoms: ['สั่น', 'กล้ามเนื้อแข็งเกร็ง', 'เคลื่อนไหวช้า'], treatment: 'ยารักษาโรคพาร์กินสัน กายภาพบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 15, disease: 'โรคกระดูกกรรไกรไม่ปกติ', symptoms: ['ปวดกราม', 'ปวดฟัน'], treatment: 'ยาแก้ปวด ยาคลายกล้ามเนื้อ และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 16, disease: 'โรคอัลซไฮเมอร์', symptoms: ['สูญเสียความจำ', 'มีปัญหาด้านความคิดและพฤติกรรม'], treatment: 'ยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 17, disease: 'โรคโครห์น', symptoms: ['ปวดท้อง', 'ท้องเสีย', 'อุจจาระร่วง'], treatment: 'ยาต้านการอักเสบ ยาต้านจุลชีพ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 18, disease: 'โรคถุงผนังลำไส้อักเสบ', symptoms: ['ปวดท้อง', 'ท้องเสีย', 'อุจจาระร่วง', 'มีเลือดหรือหนองในอุจจาระ'], treatment: 'ยาต้านการอักเสบ ยาต้านจุลชีพ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 19, disease: 'โรคไตเรื้อรัง', symptoms: ['บวม', 'เหนื่อยง่าย', 'ปัสสาวะบ่อย'], treatment: 'ยาควบคุมความดันโลหิต ยาขับปัสสาวะ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 20, disease: 'โรคเยื่อบุมดลูกต่างที่', symptoms: ['ปวดท้องประจำเดือน', 'ปวดท้องน้อย', 'ท้องอืด', 'ท้องผูก', 'ท้องเสีย'], treatment: 'ยาคุมกำเนิด ยาปฏิชีวนะ และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 21, disease: 'โรคไตอักเสบ', symptoms: ['ปวดท้อง', 'ปัสสาวะบ่อย', 'ปัสสาวะเป็นเลือด'], treatment: 'ยาปฏิชีวนะ ยาลดความดันโลหิต และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 22, disease: 'โรคตับแข็ง', symptoms: ['อ่อนเพลีย', 'บวม', 'น้ำหนักลด', 'ท้องอืด', 'ท้องผูก'], treatment: 'ยาปฏิชีวนะ ยาลดความดันโลหิต และการผ่าตัด ควรปรึกษาแพทย์' },
        { id: 23, disease: 'โรคโลหิตจาง', symptoms: ['อ่อนเพลีย', 'เวียนศีรษะ', 'หน้ามืด', 'ซีด'], treatment: 'ยาบำรุงเลือด ควรปรึกษาแพทย์' },
        { id: 24, disease: 'มะเร็งเต้านม', symptoms: ['ก้อนที่เต้านม', 'เจ็บเต้านม'], treatment: 'การผ่าตัด รังสีรักษา เคมีบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 25, disease: 'โรคสกิสโซฟรีเนีย', symptoms: ['ได้ยินเสียงหลอน', 'ประสาทหลอน', 'พูดจาวกวน'], treatment: 'ยารักษาตามอาการ ควรปรึกษาแพทย์' },
        { id: 26, disease: 'โรคไบโพลาร์', symptoms: ['อารมณ์แปรปรวน', 'ซึมเศร้า', 'อารมณ์ดีผิดปกติ'] , treatment: 'ยารักษาโรคอารมณ์สองขั้ว จิตบำบัด และการรักษาตามอาการ ควรปรึกษาแพทย์' },
         ];
        
    return database.find(entry => entry.id === diseaseId);
}

function closePopup() {
    var popup = popupStack.pop();
    if (popup) {
        popup.style.display = 'none';
    }
}

document.addEventListener('keydown', function (e) {
    if (e.key === "Escape") {
        closePopup();
        closeTreatmentPopup();
    }
});
